# YOLOv12x with DINOv3 P0 Integration - P0 Preprocessing Only
# Architecture: Input -> DINO3Preprocessor -> Standard YOLOv12x
# Clean P0-only enhancement with DINO preprocessing before YOLOv12 backbone

nc: 80  # number of classes
scale: x  # force extra scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args] - P0 Only: DINO Preprocessing + Standard YOLOv12x
  # YOLOv12x channel progression with 1.25 width scaling: 3→80→160→320→320→512→512→512→512→512
  - [-1, 1, DINO3Preprocessor, ['dinov3_vitb16', True, 3]]  # 0: P0 Input preprocessing (3→3 channels)
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2 (3→80 channels with x scaling: 64*1.25=80)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 2-P2/4 (80→160 channels with x scaling: 128*1.25=160)
  - [-1, 6, C3k2, [256, False, 0.25]]  # 3 (160→320 channels with x scaling: 256*1.25=320)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-P3/8 (320→320 channels with x scaling: 256*1.25=320)
  - [-1, 12, C3k2, [512, False, 0.25]]  # 5: Standard P3 (320→512 channels with x scaling: 512*1.25=512, capped at 512)

  # Continue standard YOLOv12x backbone - NO DINO at P3
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (512→512 channels with x scaling: 512*1.25=512, capped at 512)
  - [-1, 12, A2C2f, [512, True, 4]]  # 7: Standard P4 (512→512 channels with x scaling: 512*1.25=512, capped at 512)
  - [-1, 1, Conv, [512, 3, 2]] # 8-P5/32 (512→512 channels with x scaling: 512*1.25=512, capped at 512)
  - [-1, 12, A2C2f, [512, True, 1]]  # 9: Standard P5 (512→512 channels with x scaling: 512*1.25=512, capped at 512)

# YOLOv12x head architecture (standard - no DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (512→512 channels)
  - [[-1, 7], 1, Concat, [1]] # 11: cat P5 + P4 (512 + 512 = 1024 channels)
  - [-1, 6, A2C2f, [512, False, -1]] # 12: (1024 → 512 channels with x scaling: 512*1.25=512, capped at 512)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (512→512 channels)
  - [[-1, 5], 1, Concat, [1]] # 14: cat with standard P3 (512 + 512 = 1024 channels)
  - [-1, 6, A2C2f, [256, False, -1]] # 15: P3/8-small (1024 → 320 channels with x scaling: 256*1.25=320)

  - [-1, 1, Conv, [256, 3, 2]] # 16: (320 → 320 channels with x scaling: 256*1.25=320)
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4 (320 + 512 = 832 channels)
  - [-1, 6, A2C2f, [512, False, -1]] # 18: P4/16-medium (832 → 512 channels with x scaling: 512*1.25=512, capped at 512)

  - [-1, 1, Conv, [512, 3, 2]] # 19: (512 → 512 channels with x scaling: 512*1.25=512, capped at 512)
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (512 + 512 = 1024 channels)
  - [-1, 6, C3k2, [512, True]] # 21: P5/32-large (1024 → 512 channels with x scaling: 512*1.25=512, capped at 512)

  - [[15, 18, 21], 1, Detect, [nc]] # 22: Detect(P3=320, P4=512, P5=512)
