# YOLOv12s with Triple DINOv3 Integration - SMALL SCALE
# Architecture: DINO3Preprocessor -> YOLOv12 -> DINO3Backbone(P3) -> DINO3Backbone(P4)
# Triple integration: P0 input preprocessing + P3 backbone + P4 backbone = All levels

nc: 80  # number of classes
scale: s  # force small scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args]
  # Triple DINO: DINO3Preprocessor + Dual Backbone Integration
  # P0: DINO3Preprocessor outputs 768 channels (DINOv3 ViT-B/16)
  - [-1, 1, DINO3Preprocessor, ['CUSTOM_DINO_INPUT', True, 3]]  # 0: Input preprocessing DINO (3→768 channels)

  # YOLOv12s backbone with proper channel reduction from DINO output
  # Reduce 768 channels to YOLOv12s standard sizes (32→64→128→256)
  - [-1, 1, Conv, [32, 3, 2]]  # 1-P1/2 (768→32 channels)
  - [-1, 1, Conv, [64, 3, 2, 1, 2]] # 2-P2/4 (32→64 channels)
  - [-1, 3, C3k2, [128, False, 0.25]]  # 3 (64→128 channels)
  - [-1, 1, Conv, [128, 3, 2, 1, 4]] # 4-P3/8 (128→128 channels)
  - [-1, 6, C3k2, [256, False, 0.25]]  # 5 (128→256 channels)

  # P3: DINO3Backbone integration (maintains 256 channels)
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 256]]  # 6: P3 DINO integration (256→256 channels)

  - [-1, 1, Conv, [256, 3, 2]] # 7-P4/16 (256→256 channels)
  - [-1, 6, A2C2f, [512, True, 4]]  # 8 (256→256 channels with s scaling)

  # P4: Second DINO3Backbone integration (maintains 256 channels)
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 256]]  # 9: P4 DINO integration (256→256 channels)

  # Continue YOLOv12s backbone
  - [-1, 1, Conv, [512, 3, 2]] # 10-P5/32 (256→512 channels)
  - [-1, 3, A2C2f, [1024, True, 1]]  # 11 (512→512 channels)

# YOLOv12s head with triple DINO integration
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12 (512→512 channels)
  - [[-1, 9], 1, Concat, [1]] # 13: cat backbone P4 enhanced (512+256=768 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 14 (768→256 channels with s scaling, 256*0.5=128, 128%32=0 ✓)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 (256→256 channels)
  - [[-1, 6], 1, Concat, [1]] # 16: cat backbone P3 enhanced (256+256=512 channels)
  - [-1, 3, A2C2f, [256, False, -1]] # 17: P3/8-small (512→128 channels with s scaling, 128*0.5=64, 64%32=0 ✓)

  - [-1, 1, Conv, [128, 3, 2]] # 18 (128→128 channels)
  - [[-1, 14], 1, Concat, [1]] # 19: cat head P4 (128+256=384 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 20: P4/16-medium (384→256 channels with s scaling, 256*0.5=128, 128%32=0 ✓)

  - [-1, 1, Conv, [256, 3, 2]] # 21 (256→256 channels)
  - [[-1, 11], 1, Concat, [1]] # 22: cat head P5 (256+512=768 channels)
  - [-1, 3, C3k2, [1024, True]] # 23: P5/32-large (768→512 channels with s scaling)

  - [[17, 20, 23], 1, Detect, [nc]] # 24: Detect(P3=128, P4=256, P5=512)
