# YOLOv12n with DINOv3 ViT-B/16 Dual-Scale Integration - OBB (Oriented Bounding Box) Version
# Nano version for lightweight deployment

nc: 80  # number of classes
scale: n  # force nano scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n
  s: [0.50, 0.50, 1024]   # YOLOv12s
  m: [0.67, 0.75, 768]    # YOLOv12m
  l: [1.00, 1.00, 512]    # YOLOv12l
  x: [1.00, 1.25, 512]    # YOLOv12x

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 6, C3k2, [512, False, 0.25]]  # 4

  # FIRST DINO integration at P3 level
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 128]]  # 5: DINO enhanced P3

  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, A2C2f, [512, True, 4]]  # 7: Standard P4

  # SECOND DINO integration at P4 level
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 128]]  # 8: DINO enhanced P4

  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, A2C2f, [1024, True, 1]]  # 10: Standard P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 8], 1, Concat, [1]] # 12: cat backbone P4 enhanced
  - [-1, 3, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 5], 1, Concat, [1]] # 15: cat backbone P3 enhanced
  - [-1, 3, A2C2f, [256, False, -1]] # 16: P3/8-small

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18: cat head P4
  - [-1, 3, A2C2f, [512, False, -1]] # 19: P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21: cat head P5
  - [-1, 3, C3k2, [1024, True]] # 22: P5/32-large

  - [[16, 19, 22], 1, OBB, [nc, 1]] # 23: OBB(P3, P4, P5) with 1 angle parameter
