# YOLOv12n with DINOv3 ViT-B/16 Dual-Scale Integration - NANO VERSION
# Channel flow follows standard YOLOv12n with DINO at both P3 and P4 levels
# YOLOv12n uses width scaling = 0.25, so all channels are 1/4 of standard

nc: 80  # number of classes
scale: n  # force nano scale

scales: # model compound scaling constants (from standard yolov12.yaml)
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args]
  # Standard YOLOv12n backbone - EXACT copy from yolov12.yaml with dual DINO integration
  # YOLOv12n channel progression: 3→16→32→64→64→128→128→128→256→256 (with n scaling)
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (3→16 channels with n scaling)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4 (16→32 channels with n scaling)
  - [-1, 3, C3k2, [256, False, 0.25]]  # 2 (32→64 channels with n scaling)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8 (64→64 channels with n scaling)
  - [-1, 6, C3k2, [512, False, 0.25]]  # 4 (64→128 channels with n scaling)
  
  # FIRST DINO integration at P3 level (128 channels for nano)
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 128]]  # 5: DINO enhanced P3 (128→128 channels)
  
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (128→128 channels with n scaling)
  - [-1, 6, A2C2f, [512, True, 4]]  # 7: Standard P4 (128→128 channels with n scaling, 128*0.5=64, 64%32=0 ✓)
  
  # SECOND DINO integration at P4 level (128 channels for nano)
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 128]]  # 8: DINO enhanced P4 (128→128 channels)
  
  # Continue standard YOLOv12n backbone
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32 (128→256 channels with n scaling)
  - [-1, 3, A2C2f, [1024, True, 1]]  # 10: Standard P5 (256→256 channels with n scaling, 256*0.5=128, 128%32=0 ✓)

# Standard YOLOv12n head with dual DINO enhancements
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 (256→256 channels)
  - [[-1, 8], 1, Concat, [1]] # 12: cat backbone P4 enhanced (256+128=384 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 13 (384→128 channels with n scaling, 128*0.5=64, 64%32=0 ✓)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 (128→128 channels)
  - [[-1, 5], 1, Concat, [1]] # 15: cat backbone P3 enhanced (128+128=256 channels)  
  - [-1, 3, A2C2f, [256, False, -1]] # 16: P3/8-small (256→64 channels with n scaling, 64*0.5=32, 32%32=0 ✓)

  - [-1, 1, Conv, [256, 3, 2]] # 17 (64→64 channels with n scaling)
  - [[-1, 13], 1, Concat, [1]] # 18: cat head P4 (64+128=192 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 19: P4/16-medium (192→128 channels with n scaling, 128*0.5=64, 64%32=0 ✓)

  - [-1, 1, Conv, [512, 3, 2]] # 20 (128→128 channels with n scaling)
  - [[-1, 10], 1, Concat, [1]] # 21: cat head P5 (128+256=384 channels)
  - [-1, 3, C3k2, [1024, True]] # 22: P5/32-large (384→256 channels with n scaling)

  - [[16, 19, 22], 1, Detect, [nc]] # 23: Detect(P3=64, P4=128, P5=256)