# YOLOv12n with DINOv3 Preprocessing - NANO VERSION
# Architecture: Input -> DINO3Preprocessor -> Original YOLOv12n
# Uses original YOLOv12n architecture with DINO preprocessing at input level

nc: 80 # number of classes
scale: n # force nano scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024] # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args] - DINO3 Preprocessor followed by exact YOLOv12n backbone
  - [-1, 1, DINO3Preprocessor, ["DINO_MODEL_NAME", True, 3]] # 0: Input enhancement (3 channels)
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2 (3→16 channels with n scaling)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 2-P2/4 (16→32 channels with n scaling)
  - [-1, 3, C3k2, [256, False, 0.25]] # 3 (32→64 channels with n scaling)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-P3/8 (64→64 channels with n scaling)
  - [-1, 6, C3k2, [512, False, 0.25]] # 5 (64→128 channels with n scaling)
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (128→128 channels with n scaling)
  - [-1, 6, A2C2f, [512, True, 4]] # 7 (128→128 channels with n scaling)
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32 (128→256 channels with n scaling)
  - [-1, 3, A2C2f, [1024, True, 1]] # 9 (256→256 channels with n scaling)

# YOLOv12n head - adjusted layer indices for preprocessor insertion
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 7], 1, Concat, [1]] # 11: cat backbone P4 (layer 7)
  - [-1, 3, A2C2f, [512, False, -1]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 5], 1, Concat, [1]] # 14: cat backbone P3 (layer 5)
  - [-1, 3, A2C2f, [256, False, -1]] # 15

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4
  - [-1, 3, A2C2f, [512, False, -1]] # 18

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (layer 9)
  - [-1, 3, C3k2, [1024, True]] # 21

  - [[15, 18, 21], 1, Detect, [nc]] # 22: Detect(P3, P4, P5)
