# YOLOv12s with DINOv3 P0 Integration - OBB (Oriented Bounding Box) Version
# Architecture: Input -> DINO3Preprocessor -> Standard YOLOv12s -> OBB Head
# Clean P0-only enhancement with DINO preprocessing before YOLOv12 backbone

nc: 80  # number of classes
scale: s  # force small scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n
  s: [0.50, 0.50, 1024]   # YOLOv12s
  m: [0.67, 0.75, 768]    # YOLOv12m
  l: [1.00, 1.00, 512]    # YOLOv12l
  x: [1.00, 1.25, 512]    # YOLOv12x

backbone:
  # [from, repeats, module, args] - P0 Only: DINO Preprocessing + Standard YOLOv12s
  # YOLOv12s channel progression with 0.5 width scaling: 3->32->64->128->128->256->256->256->512->512
  - [-1, 1, DINO3Preprocessor, ['dinov3_vitb16', True, 3]]  # 0: P0 Input preprocessing (3->3 channels)
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2 (3->32 channels with s scaling: 64*0.5=32)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 2-P2/4 (32->64 channels with s scaling: 128*0.5=64)
  - [-1, 3, C3k2, [256, False, 0.25]]  # 3 (64->128 channels with s scaling: 256*0.5=128)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-P3/8 (128->128 channels with s scaling: 256*0.5=128)
  - [-1, 6, C3k2, [512, False, 0.25]]  # 5: Standard P3 (128->256 channels with s scaling: 512*0.5=256)

  # Continue standard YOLOv12s backbone - NO DINO at P3
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (256->256 channels with s scaling: 512*0.5=256)
  - [-1, 6, A2C2f, [512, True, 4]]  # 7: Standard P4 (256->256 channels with s scaling: 512*0.5=256)
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32 (256->512 channels with s scaling: 1024*0.5=512)
  - [-1, 6, A2C2f, [1024, True, 1]]  # 9: Standard P5 (512->512 channels with s scaling: 1024*0.5=512)

# YOLOv12s head architecture (standard - no DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (512->512 channels)
  - [[-1, 7], 1, Concat, [1]] # 11: cat P5 + P4 (512 + 256 = 768 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 12: (768 -> 256 channels with s scaling: 512*0.5=256)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (256->256 channels)
  - [[-1, 5], 1, Concat, [1]] # 14: cat with standard P3 (256 + 256 = 512 channels)
  - [-1, 3, A2C2f, [256, False, -1]] # 15: P3/8-small (512 -> 128 channels with s scaling: 256*0.5=128)

  - [-1, 1, Conv, [256, 3, 2]] # 16: (128 -> 128 channels with s scaling: 256*0.5=128)
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4 (128 + 256 = 384 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 18: P4/16-medium (384 -> 256 channels with s scaling: 512*0.5=256)

  - [-1, 1, Conv, [512, 3, 2]] # 19: (256 -> 256 channels with s scaling: 512*0.5=256)
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (256 + 512 = 768 channels)
  - [-1, 3, C3k2, [1024, True]] # 21: P5/32-large (768 -> 512 channels with s scaling: 1024*0.5=512)

  - [[15, 18, 21], 1, OBB, [nc, 1]] # 22: OBB(P3=128, P4=256, P5=512) with 1 angle parameter
