# YOLOv12l with DINOv3 ViT-7B/16 Dual-Scale Integration
# Systematic naming: yolov12l-dino3-vit7b16-dual
# Experimental ultra-high performance large configuration with P3+P4 enhancement (6.7B parameters)

nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  m: [0.67, 0.75, 768]    # Medium
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.25, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  # YOLOv12l backbone with DINOv3 ViT-7B/16 integration at P3 and P4
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  
  # First DINOv3 ViT-7B/16 enhancement at P3 level (4096 embed_dim -> 256 channels for large)
  - [-1, 1, DINO3Backbone, ['dinov3_vit7b16', True, 256, '3']]  # 5: DINOv3 7B enhanced P3
  
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  
  # Second DINOv3 ViT-7B/16 enhancement at P4 level (4096 embed_dim -> 512 channels for large)
  - [-1, 1, DINO3Backbone, ['dinov3_vit7b16', True, 512, '3']]  # 8: DINOv3 7B enhanced P4
  
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]

# YOLOv12 head with dual DINOv3-enhanced features
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4 (DINOv3-enhanced)
  - [-1, 4, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3 (DINOv3-enhanced)
  - [-1, 4, A2C2f, [256, False, -1]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 4, A2C2f, [512, False, -1]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 4, A2C2f, [1024, False, -1]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)