# YOLOv12l with DINOv3 DualP0P3 Integration - OBB (Oriented Bounding Box) Version
# Architecture: Input -> DINO3Preprocessor -> YOLOv12 -> DINO3(P3) -> OBB Head
# Optimized dual enhancement targeting P0 input and P3 backbone levels

nc: 80 # number of classes
scale: l # force large scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # YOLOv12n
  s: [0.50, 0.50, 1024] # YOLOv12s
  m: [0.67, 0.75, 768] # YOLOv12m
  l: [1.00, 1.00, 512] # YOLOv12l
  x: [1.00, 1.25, 512] # YOLOv12x

backbone:
  # [from, repeats, module, args] - DualP0P3: P0 Preprocessing + P3 Backbone Enhancement
  # YOLOv12l channel progression with 1.0 width scaling: 3->64->128->256->256->512->512->512->512->512
  - [-1, 1, DINO3Preprocessor, ["dinov3_vitb16", True, 3]] # 0: P0 Input preprocessing (3->3 channels)
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2 (3->64 channels with l scaling: 64*1.0=64)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 2-P2/4 (64->128 channels with l scaling: 128*1.0=128)
  - [-1, 2, C3k2, [256, False, 0.25]] # 3 (128->256 channels with l scaling: 256*1.0=256)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-P3/8 (256->256 channels with l scaling: 256*1.0=256)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5: Standard P3 (256->512 channels with l scaling: 512*1.0=512)

  # DINO integration at P3 level - maintain exact same channel count for YOLOv12l
  - [-1, 1, DINO3Backbone, ["dinov3_vitb16", True, 512]] # 6: DINO enhanced P3 (512->512 channels)

  # Continue standard YOLOv12l backbone
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16 (512->512 channels with l scaling: 512*1.0=512)
  - [-1, 4, A2C2f, [512, True, 4]] # 8: Standard P4 (512->512 channels with l scaling: 512*1.0=512)
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32 (512->512 channels with l scaling: 1024*1.0=512, limited by max_channels=512)
  - [-1, 4, A2C2f, [1024, True, 1]] # 10: Standard P5 (512->512 channels with l scaling: 1024*1.0=512, limited by max_channels=512)

# YOLOv12l head architecture (adjusted for P0+P3 DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 (512->512 channels)
  - [[-1, 8], 1, Concat, [1]] # 12: cat P5 + P4 (512 + 512 = 1024 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 13: (1024 -> 512 channels with l scaling: 512*1.0=512)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 (512->512 channels)
  - [[-1, 6], 1, Concat, [1]] # 15: cat with enhanced P3 (512 + 512 = 1024 channels)
  - [-1, 2, A2C2f, [256, False, -1]] # 16: P3/8-small (1024 -> 256 channels with l scaling: 256*1.0=256)

  - [-1, 1, Conv, [256, 3, 2]] # 17: (256 -> 256 channels with l scaling: 256*1.0=256)
  - [[-1, 13], 1, Concat, [1]] # 18: cat head P4 (256 + 512 = 768 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 19: P4/16-medium (768 -> 512 channels with l scaling: 512*1.0=512)

  - [-1, 1, Conv, [512, 3, 2]] # 20: (512 -> 512 channels with l scaling: 512*1.0=512)
  - [[-1, 10], 1, Concat, [1]] # 21: cat head P5 (512 + 512 = 1024 channels)
  - [-1, 2, C3k2, [1024, True]] # 22: P5/32-large (1024 -> 512 channels with l scaling: 1024*1.0=512, limited by max_channels=512)

  - [[16, 19, 22], 1, OBB, [nc, 1]] # 23: OBB(P3=256, P4=512, P5=512) with 1 angle parameter
