# YOLOv12n with DINOv3 ViT-L/16 Single-Scale Integration - NANO VERSION
# Channel flow follows standard YOLOv12n exactly, with DINO at P4 level only
# YOLOv12n uses width scaling = 0.25, so all channels are 1/4 of standard size
# ViT-L/16 has 1024 embed_dim, properly mapped to YOLOv12n P4 level (128 channels)

nc: 80  # number of classes
scale: n  # force nano scale

scales: # model compound scaling constants (from standard yolov12.yaml)
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs

backbone:
  # [from, repeats, module, args]
  # Standard YOLOv12n backbone - EXACT copy from yolov12.yaml with DINO insertion at P4 only
  # YOLOv12n channel progression: 3→16→32→64→64→128→128→128→256→256 (with n scaling 0.25x)
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (3→16 channels with n scaling)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4 (16→32 channels with n scaling)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 (32→64 channels with n scaling)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8 (64→64 channels with n scaling)
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4: Standard P3 (64→128 channels with n scaling)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 (128→128 channels with n scaling)
  - [-1, 4, A2C2f, [512, True, 4]]  # 6: Standard P4 (128→128 channels with n scaling)
  
  # DINO integration at P4 level - ViT-L/16 with 1024 embed_dim mapped to 128 channels
  - [-1, 1, DINO3Backbone, ['dinov3_vitl16', True, 128]]  # 7: DINO enhanced P4 (128→128 channels)
  
  # Continue standard YOLOv12n backbone
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32 (128→256 channels with n scaling)
  - [-1, 4, A2C2f, [1024, True, 1]]  # 9: Standard P5 (256→256 channels with n scaling)

# Standard YOLOv12n head architecture (adjusted for single DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (256→256 channels)
  - [[-1, 7], 1, Concat, [1]] # 11: cat P5 + enhanced P4 (256 + 128 = 384 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 12: (384 → 128 channels with n scaling)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (128→128 channels)
  - [[-1, 4], 1, Concat, [1]] # 14: cat with standard P3 (128 + 128 = 256 channels)
  - [-1, 2, A2C2f, [256, False, -1]] # 15: P3/8-small (256 → 64 channels with n scaling)

  - [-1, 1, Conv, [256, 3, 2]] # 16: (64 → 64 channels with n scaling)
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4 (64 + 128 = 192 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 18: P4/16-medium (192 → 128 channels with n scaling)

  - [-1, 1, Conv, [512, 3, 2]] # 19: (128 → 128 channels with n scaling)
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (128 + 256 = 384 channels) 
  - [-1, 2, C3k2, [1024, True]] # 21: P5/32-large (384 → 256 channels with n scaling)

  - [[15, 18, 21], 1, Detect, [nc]] # 22: Detect(P3=64, P4=128, P5=256)