# YOLOv12s with DINOv3 Integration - Final Working Version
# Based on exact YOLOv12s structure with DINO inserted after backbone layer 6

nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  m: [0.67, 0.75, 768]    # Medium
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.25, 512]    # Extra Large

backbone:
  # [from, repeats, module, args] - Exact YOLOv12s backbone
  - [-1, 1, Conv, [64, 3, 2]]       # 0
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5
  - [-1, 4, A2C2f, [512, True, 4]]  # 6 - Standard A2C2f (512 channels)
  
  # Insert DINO3Backbone here (512 -> 512 channels)
  - [-1, 1, DINO3Backbone, ['CUSTOM_DINO_INPUT', True, 512]]  # 7: DINO enhanced
  
  # Continue exact base structure
  - [-1, 1, Conv, [1024, 3, 2]]     # 8 (was 7 in base)
  - [-1, 4, A2C2f, [1024, True, 1]] # 9 (was 8 in base)

# YOLOv12s head - adjusted for DINO layer insertion
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (was 0)
  - [[-1, 7], 1, Concat, [1]]       # 11: cat P5 + DINO enhanced P4 (1024 + 512 = 1536)
  - [-1, 2, A2C2f, [512, False, -1]] # 12: (was 2)
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: (was 3)
  - [[-1, 4], 1, Concat, [1]]       # 14: cat with P3 (512 + 512 = 1024)
  - [-1, 2, A2C2f, [256, False, -1]] # 15: (was 5)
  
  - [-1, 1, Conv, [256, 3, 2]]      # 16: (was 6)
  - [[-1, 12], 1, Concat, [1]]      # 17: cat head P4 (256 + 512 = 768)
  - [-1, 2, A2C2f, [512, False, -1]] # 18: (was 8)
  
  - [-1, 1, Conv, [512, 3, 2]]      # 19: (was 9)
  - [[-1, 9], 1, Concat, [1]]       # 20: cat head P5 (512 + 1024 = 1536)
  - [-1, 2, C3k2, [1024, True]]     # 21: (was 11)
  
  - [[15, 18, 21], 1, Detect, [nc]] # 22: Detect (was 12)